In [2]:
import pandas as pd
import numpy as np

## Pandas_DataFrame

In [30]:
record1 = [{'Name': 'John', 'Age': 20, 'Salary': 10000},
           {'Name': 'jhon', 'Age': 25, 'Salary': 20000},
           {'Name': 'sam', 'Age': 30, 'Salary': 30000}]

# * you can use pd.series instead of list of dicts

df = pd.DataFrame(record1, index=[
                  'school1', 'school2', 'school2'])
df

         Name  Age  Salary
school1  John   20   10000
school2  jhon   25   20000
school2   sam   30   30000

In [9]:
print(df.loc['school1'])
print(type(df.loc['school1']))

Name       John
Age          20
Salary    10000
Name: school1, dtype: object
<class 'pandas.core.series.Series'>

In [13]:
print(type(df.loc['school2']))
df.loc['school2']

<class 'pandas.core.frame.DataFrame'>

         Name  Age  Salary
school2  jhon   25   20000
school2   sam   30   30000

In [16]:
df.loc['school2']['Age']
df.loc['school2','Age']

school2    25
school2    30
Name: Age, dtype: int64

In [18]:
df.T

       school1 school2 school2
Name      John    jhon     sam
Age         20      25      30
Salary   10000   20000   30000

In [20]:
df.T.loc['Name']

school1    John
school2    jhon
school2     sam
Name: Name, dtype: object

In [21]:
df['Name']

school1    John
school2    jhon
school2     sam
Name: Name, dtype: object

## loc/iloc only work on index

In [24]:
df.loc[:,['Name','Age']]

         Name  Age
school1  John   20
school2  jhon   25
school2   sam   30

In [25]:
df[["Name",'Age']]

         Name  Age
school1  John   20
school2  jhon   25
school2   sam   30

## Dropping data

In [28]:
#* inplace=True means it will directly change the dataframe
df.drop('school1', inplace=False)

In [31]:
df.drop('Name', axis=1)  #* axis=1 , column

         Age  Salary
school1   20   10000
school2   25   20000
school2   30   30000

In [33]:
df.drop('school2') #* axis=0 , row

         Name  Age  Salary
school1  John   20   10000